weaver/socialnetwork/evaluation/gcp/2024-09-04_00:01:20/workload.out
Running 5m test @ http://34.141.89.72:12345/wrk2-api/post/compose
  30 threads and 30 connections
  Thread calibration: mean lat.: 447.062ms, rate sampling interval: 1559ms
  Thread calibration: mean lat.: 876.684ms, rate sampling interval: 4124ms
  Thread calibration: mean lat.: 797.799ms, rate sampling interval: 3278ms
  Thread calibration: mean lat.: 602.169ms, rate sampling interval: 2246ms
  Thread calibration: mean lat.: 544.743ms, rate sampling interval: 2396ms
  Thread calibration: mean lat.: 474.951ms, rate sampling interval: 2006ms
  Thread calibration: mean lat.: 426.415ms, rate sampling interval: 1590ms
  Thread calibration: mean lat.: 613.871ms, rate sampling interval: 2197ms
  Thread calibration: mean lat.: 550.605ms, rate sampling interval: 2375ms
  Thread calibration: mean lat.: 618.063ms, rate sampling interval: 2521ms
  Thread calibration: mean lat.: 1329.349ms, rate sampling interval: 4022ms
  Thread calibration: mean lat.: 324.831ms, rate sampling interval: 1182ms
  Thread calibration: mean lat.: 317.694ms, rate sampling interval: 1354ms
  Thread calibration: mean lat.: 475.097ms, rate sampling interval: 1730ms
  Thread calibration: mean lat.: 238.949ms, rate sampling interval: 938ms
  Thread calibration: mean lat.: 590.484ms, rate sampling interval: 2359ms
  Thread calibration: mean lat.: 628.713ms, rate sampling interval: 3014ms
  Thread calibration: mean lat.: 1120.773ms, rate sampling interval: 4575ms
  Thread calibration: mean lat.: 538.065ms, rate sampling interval: 2125ms
  Thread calibration: mean lat.: 829.796ms, rate sampling interval: 3293ms
  Thread calibration: mean lat.: 770.261ms, rate sampling interval: 3235ms
  Thread calibration: mean lat.: 227.918ms, rate sampling interval: 871ms
  Thread calibration: mean lat.: 1032.604ms, rate sampling interval: 4171ms
  Thread calibration: mean lat.: 543.500ms, rate sampling interval: 2398ms
  Thread calibration: mean lat.: 467.018ms, rate sampling interval: 1840ms
  Thread calibration: mean lat.: 530.185ms, rate sampling interval: 1923ms
  Thread calibration: mean lat.: 754.839ms, rate sampling interval: 2404ms
  Thread calibration: mean lat.: 813.158ms, rate sampling interval: 2865ms
  Thread calibration: mean lat.: 454.427ms, rate sampling interval: 1637ms
  Thread calibration: mean lat.: 501.047ms, rate sampling interval: 2252ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     0.87m    47.83s    2.67m    68.60%
    Req/Sec     3.91      1.82     9.00     86.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.42s 
 75.000%    1.46m 
 90.000%    2.17m 
 99.000%    2.67m 
 99.900%    2.77m 
 99.990%    2.82m 
 99.999%    2.84m 
100.000%    2.84m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      34.367     0.000000            1         1.00
    4048.895     0.100000         3831         1.11
    7299.071     0.200000         7666         1.25
   12902.399     0.300000        11493         1.43
   22249.471     0.400000        15324         1.67
   35422.207     0.500000        19156         2.00
   43876.351     0.550000        21075         2.22
   53444.607     0.600000        22992         2.50
   63832.063     0.650000        24903         2.86
   75563.007     0.700000        26816         3.33
   87818.239     0.750000        28733         4.00
   94044.159     0.775000        29690         4.44
  100925.439     0.800000        30648         5.00
  107806.719     0.825000        31608         5.71
  115146.751     0.850000        32565         6.67
  122486.783     0.875000        33525         8.00
  126287.871     0.887500        34001         8.89
  130154.495     0.900000        34477        10.00
  134086.655     0.912500        34958        11.43
  138149.887     0.925000        35445        13.33
  142213.119     0.937500        35919        16.00
  144310.271     0.943750        36168        17.78
  146276.351     0.950000        36396        20.00
  148373.503     0.956250        36646        22.86
  150339.583     0.962500        36872        26.67
  152567.807     0.968750        37124        32.00
  153485.311     0.971875        37239        35.56
  154533.887     0.975000        37359        40.00
  155582.463     0.978125        37474        45.71
  156762.111     0.981250        37596        53.33
  157941.759     0.984375        37711        64.00
  158597.119     0.985938        37772        71.11
  159252.479     0.987500        37831        80.00
  159907.839     0.989062        37893        91.43
  160563.199     0.990625        37948       106.67
  161349.631     0.992188        38016       128.00
  161611.775     0.992969        38039       142.22
  162136.063     0.993750        38081       160.00
  162529.279     0.994531        38107       182.86
  162922.495     0.995313        38132       213.33
  163315.711     0.996094        38165       256.00
  163577.855     0.996484        38179       284.44
  163839.999     0.996875        38189       320.00
  164233.215     0.997266        38208       365.71
  164495.359     0.997656        38218       426.67
  165019.647     0.998047        38239       512.00
  165150.719     0.998242        38243       568.89
  165281.791     0.998437        38250       640.00
  165543.935     0.998633        38256       731.43
  165937.151     0.998828        38268       853.33
  166199.295     0.999023        38272      1024.00
  166330.367     0.999121        38274      1137.78
  166461.439     0.999219        38278      1280.00
  166723.583     0.999316        38282      1462.86
  166854.655     0.999414        38285      1706.67
  167247.871     0.999512        38289      2048.00
  167510.015     0.999561        38292      2275.56
  167641.087     0.999609        38293      2560.00
  167772.159     0.999658        38295      2925.71
  168034.303     0.999707        38296      3413.33
  168296.447     0.999756        38298      4096.00
  168427.519     0.999780        38299      4551.11
  168558.591     0.999805        38300      5120.00
  168820.735     0.999829        38301      5851.43
  168951.807     0.999854        38302      6826.67
  169213.951     0.999878        38303      8192.00
  169213.951     0.999890        38303      9102.22
  169738.239     0.999902        38304     10240.00
  169738.239     0.999915        38304     11702.86
  169869.311     0.999927        38305     13653.33
  169869.311     0.999939        38305     16384.00
  169869.311     0.999945        38305     18204.44
  170393.599     0.999951        38306     20480.00
  170393.599     0.999957        38306     23405.71
  170393.599     0.999963        38306     27306.67
  170393.599     0.999969        38306     32768.00
  170393.599     0.999973        38306     36408.89
  170655.743     0.999976        38307     40960.00
  170655.743     1.000000        38307          inf
#[Mean    =    52154.964, StdDeviation   =    47829.121]
#[Max     =   170524.672, Total count    =        38307]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  40911 requests in 5.00m, 22.74MB read
  Socket errors: connect 0, read 0, write 0, timeout 80
Requests/sec:    136.36
Transfer/sec:     77.60KB
